{"exp":1341835457,"@meta":{"serverTimeMs":22,"requestId":"0WH0DS5VPS40WZM2MPZF"},"data":{"trivia":[{"text":"Chosen by Empire magazine as one of the 100 Sexiest Stars in film history (#15).","date":{"normal":"1995"}},{"text":"Was a master carpenter before becoming a movie star, a craft he still does as a hobby."},{"text":"Revealed on the \"Late Show with David Letterman\" that he has some false teeth; 2 were pulled by a dentist after some others were damaged when he fell on a gun during a stunt for a TV appearance early in his career."},{"text":"He provided the whip-cracks on the song \"Desperation Samba (Halloween in Tijuana)\" for Jimmy Buffett's album \"Last Mango in Paris\""},{"text":"Private pilot, single engine fixed wing and helicopter. Owns a Bonanza, Gulfstream IV, DeHavland Beaver, and Bell 407 helicopter. Destroyed first 407 during simulated \"engine-out\" practice. Regularly flies himself between New York City and Wyoming homes. Has a loft in Tribeca, NYC."},{"text":"Chosen as People Magazine's Sexiest Man Alive.","date":{"normal":"1998"}},{"text":"Ranked #1 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list.","date":{"normal":"1997-10"}},{"text":"Chosen by \"People\" magazine as one of the 50 Most Beautiful People in the World.","date":{"normal":"1997"}},{"text":"Listed as one of 50 people barred from entering Tibet. Disney clashed with Chinese officials over the film \"Kundun\", which Ford's second wife, Melissa Mathison, wrote.","date":{"normal":"1996-12-19"}},{"text":"Studied at Ripon College in Ripon, Wisconsin, but left without obtaining a degree."},{"text":"His ex-wife, Melissa Mathison, wrote the screenplay for \"E.T.: The Extra-Terrestrial\"."},{"text":"Considers \"The Mosquito Coast\" to be the favorite of all his movies."},{"text":"Lives in a white-painted ranch house that he built himself in Jackson Hole, Wyoming."},{"text":"Has a scar on his chin which he got in 1968 when he tried to \"buckle up\" while already driving, and lost control of the car. The scar has been explained in two of his films: in the River Phoenix introductory sequence in \"Indiana Jones and the Last Crusade\", an inexperienced young Indy hits himself in the chin the first time he tries to use the whip; and in \"Working Girl\", he first says that he got the scar in a knife fight, then admits that the true story is that he knocked his chin on a toilet after fainting during an ear-piercing."},{"text":"He was billed as Harrison J. Ford until 1970 for less confusion between him and silent-screen actor Harrison Ford. He actually has no middle name."},{"text":"While in college Ford appeared as Mac the Knife in the musical play, \"The Threepenny Opera\"."},{"text":"Older brother of Terence Ford."},{"text":"Piloted his helicopter to rescue dehydrated 20-year-old hiker Sarah George from Table Mountain near his ranch in Jackson Hole, Wyoming.","date":{"normal":"2000-07-31"}},{"text":"Turned down the romance-action film \"Proof of Life\" (the 'Russell Crowe (I)' role), the summer-blockbuster \"The Perfect Storm\" (the George Clooney role), and finally, another summer-blockbuster, the war-epic \"The Patriot\" (the Mel Gibson role). Ford has said \"The Patriot\" was \"too violent\" for his tastes, especially considering that many children were killed and endangered throughout the film. He told People Magazine that he also turned down the film because he felt the story was too simple: \"The Revolutionary War boiled down to one man seeking revenge\"."},{"text":"Replaced Kevin Costner in \"Air Force One\"."},{"text":"Listed in the 2001 Guinness Book of Records as the richest male actor."},{"text":"Turned down the role of Judge Wakefield in the movie \"Traffic\"."},{"text":"Credited with \"creating\" what many believe to be the best scene in \"Raiders of the Lost Ark\" because he was suffering from a bout of dysentery at the time of filming: during the scene in Cairo with the swordsman in black, the script called for a much longer fight, but because of his condition, he quietly asked director Steven Spielberg if they could shorten the scene. Spielberg's reply was that the only way it could be done would be if Indy pulled out his gun and \"just shot the guy.\" The rest of the crew, not aware of the change, laughed at this, and it remained in the final cut."},{"text":"Honored for his work with the environment, Ford was asked to name a new breed of butterfly. He named it after his daughter, Georgia."},{"text":"\"Dragonfly\" was written with Ford in mind for the lead role. He turned it down to take a year off from making movies, and the part was given to Kevin Costner."},{"text":"His and Kevin Costner's casting choices have crossed paths many times before. Ford turned down the Jack Ryan role in \"The Hunt for Red October\", as did Costner. Ford instead made \"Presumed Innocent\" and Costner made his Oscar-winning \"Dances with Wolves\". The Jack Ryan role went to Alec Baldwin."},{"text":"The U.S. box office grosses of all of Ford's films total about $3.18 billion, with worldwide grosses totaling approximately $5.65 billion. No other actor in history has box-office grosses as large as Ford's."},{"text":"Has a species of Central American ant (Peidole harrisonfordi) and spider (Calponia Harrisonfordi) named after him in honor of his conservation work."},{"text":"He suffered a back injury while filming \"Indiana Jones and the Temple of Doom\" and underwent an experimental (at the time) disc operation utilizing a papaya enzyme. While he was away Steven Spielberg filmed around him as best he could, including most of the conveyor belt scene, using Vic Armstrong, a British-born stunt man who looked so much like Ford that members of the crew were always confusing the two. Ford resumed doing his own stunts upon his return, and his close-ups were added later into the finished film."},{"text":"Recommended River Phoenix for the role of the young Indiana Jones in \"Indiana Jones and the Last Crusade\". Ford and Phoenix had previously played father and son in \"The Mosquito Coast\"."},{"text":"Ranked #8 in Star TV's Top 10 Box Office Stars of the 1990s (2003)."},{"text":"He was a member of Sigma Nu fraternity in college."},{"text":"30 May 2003: Received star on Hollywood Walk of Fame."},{"text":"Both his Indiana Jones jacket and fedora hat are on display at the Smithsonian Institution."},{"text":"He nearly turned down the role of Henry in \"Regarding Henry\" because the main character was a trial lawyer. He had just played one in \"Presumed Innocent\", and was afraid of being typecast. He took the role when he realized that Henry would only be functioning as a lawyer for the first ten minutes of the film."},{"text":"October 2003: Had surgery on a torn rotator cuff."},{"text":"Was the second actor to play Tom Clancy's CIA man Jack Ryan (in \"Patriot Games\" and \"Clear and Present Danger\") after the first actor, Alec Baldwin backed out after \"The Hunt for Red October\". Ben Affleck is the third to take the part."},{"text":"Worked as a carpenter in Los Angeles before achieving fame in movies, mainly doing home remodeling work. Had a reputation as one of the best cabinetmakers in the city, and his services were much in demand on Los Angeles' trendy Westside long before he became a movie star."},{"text":"At the time his divorce from Melissa Mathison was the most expensive in the history of Hollywood. Today it is ranked the fourth."},{"text":"Scared director Steven Spielberg and the crew during \"Indiana Jones and the Temple of Doom\" when, without warning, he ran out across the rope bridge used in the film's climax to test its safety. Spielberg later quipped \"What can I say? Harrison really IS Indiana Jones.\"."},{"text":"During the scene where he is frozen in carbonite in \"Star Wars: Episode V - The Empire Strikes Back\", Carrie Fisher says, \"I love you.\" and Ford was supposed to reply \"I love you too.\" but he suggested changing it to \"I know.\""},{"text":"Children: with Mary Marquardt, sons Ben Ford (Benjamin) (b. 22.09.1967) and Willard (b. 14-05-1969); with Melissa Mathison, son Malcolm Ford (b. 10-03- 1987) and daughter Georgia (b. 30-06-1991)."},{"text":"Was offered the part of Mike Stivic on \"All in the Family\", but turned it down, citing the bigotry of Archie Bunker was too offensive."},{"text":"Has been in three films written by Lawrence Kasdan, but never one directed by him. Kasdan wrote \"Star Wars: Episode V - The Empire Strikes Back\", \"Star Wars: Episode VI - Return of the Jedi\" and \"Raiders of the Lost Ark\"."},{"text":"His character, Han Solo, was ranked number 33 in Comedy Central's 'Mouthing Off: 51 Greatest Smartasses'."},{"text":"He had a role as the school principal in \"E.T.: The Extra-Terrestrial\" who lectures Elliot about the dangers of alcohol. The scene was cut because director Steven Spielberg felt that Ford's presence would break the flow of the film. The only footage known to exist appeared in The E.T. Storybook released at the same time as the film."},{"text":"His favorite record is \"On the Edge\", by his favorite artist, Patrick Rondat."},{"text":"He was voted the 46th Greatest Movie Star of all time by Entertainment Weekly."},{"text":"Said that \"Blade Runner\" was one of the most frustrating films he'd ever done, because the actual shoot was very grueling and because of the post-production changes which were meant to (but didn't) help the film do better at the box office."},{"text":"Was originally brought in by George Lucas to feed lines to other actors auditioning for \"Star Wars: Episode IV - A New Hope\" because he wasn't allowed to audition (Lucas wanted new faces for the film). He eventually won Lucas over and the role of Han Solo went to him."},{"text":"Once described Han Solo as \"The great rapscallion of the universe.\""},{"text":"Out of the three leads of the original Star Wars trilogy, he was the only one to appear in all three films without ever signing a contract."},{"text":"Was friends with Billy Dee Williams before they appeared together in \"Star Wars: Episode V - The Empire Strikes Back\". Williams had tested for the role of Han Solo in the original film."},{"text":"He has acted alongside four actors from \"The Lord of the Rings\" series before they appeared in the trilogy. John Rhys-Davies in \"Raiders of the Lost Ark\"; Viggo Mortensen in \"Witness\"; Sean Bean in \"Patriot Games\" and Miranda Otto in \"What Lies Beneath\"."},{"text":"When he arrived in England to start filming \"Star Wars: Episode IV - A New Hope\", Alec Guinness helped him find an apartment."},{"text":"Said in an interview that he felt compelled to do his own stunts for the Indiana Jones trilogy because the film was very \"action oriented\" and that he felt if he weren't in the middle of it, then were really wasn't much else for him to do."},{"text":"Said one of the things he enjoyed most about making both \"Witness\" and \"The Mosquito Coast\" was getting to apply his real life skills as a carpenter (example: the barn raising scene from \"Witness\")."},{"text":"His characters, Han Solo and Indiana Jones respectively, are both brutally tortured in \"Star Wars: Episode V - The Empire Strikes Back\" and \"Indiana Jones and the Temple of Doom\", the second installments of both trilogies."},{"text":"\"Witness\" was his first role that broke him away from the science fiction and fantasy genres that made him famous. It does, however, still have a connection to his breakthrough role of Han Solo. One of the cast members was Robert Earl Jones, whose son, James Earl Jones, was the voice of Darth Vader. He also worked with Ford in \"Patriot Games\" and \"Clear and Present Danger\"."},{"text":"Daughter Georgia attends Wildwood School in Los Angeles, where the children of Demi Moore, Bill Pullman, Bruce Willis, Eddie Murphy, Steven Spielberg and several over music and entertainment personalities attend, and is great friends with Elliot Murphy, son of Eddie."},{"text":"Premiere Magazine ranked him as #35 on a list of the Greatest Movie Stars of All Time in their Stars in Our Constellation feature (2005)."},{"text":"While filming \"Firewall\" in Vancouver, British Columbia, he was so impressed with the beauty of Bowen Island that he purchased a $13-million waterfront property upon the request of girlfriend Calista Flockhart."},{"text":"Indiana Jones was voted the second greatest screen hero of all time by the American Film Institute, just behind Gregory Peck's Atticus Finch in \"To Kill a Mockingbird\". Han Solo was ranked at #14."},{"text":"Has been pursued by two generations of the Fett family of bounty hunters. In \"Star Wars: Episode V - The Empire Strikes Back\", he is captured by Boba Fett at the end of the film. In \"Six Days Seven Nights\" he is pursued by Temuera Morrison, who played Jango Fett, and his progeny, the stormtroopers, in \"Star Wars: Episode II - Attack of the Clones\" and \"Star Wars: Episode III - Revenge of the Sith\"."},{"text":"In 2003, he accepted the Oscar for \"Best Director\" on behalf of Roman Polanski, who wasn't present at the awards ceremony, being a fugitive from U.S. justice since fleeing the country in 1978."},{"text":"He initially argued against casting Sean Connery as his father in \"Indiana Jones and the Last Crusade\" because Connery was only 12-years older. He later changed his mind and found he enjoyed working with Connery immensely."},{"text":"Tore a ligament in his knee while filming the special shoot trailer for \"The Fugitive\", in which he took the lead role after Alec Baldwin backed out (as had happened with \"Patriot Games\"). During the film's PR campaign, he complained that he'd made it through the entire shoot unscathed, only to injure himself shooting a trailer for the movie after production was finished."},{"text":"Has worked with two leading cast members from the \"Star Wars: Rebel Assault II - the Hidden Empire\" video game. Julie Eccles as Irene in \"Indiana Jones and the Last Crusade\", and Jamison Jones as one of his fellow officers in \"Hollywood Homicide\"."},{"text":"Carrie Fisher had to stand on a box for most of her scenes with him in the Star Wars trilogy because she was a foot shorter than him and did not properly fit into the frame."},{"text":"Was the subject of a song by folksinger Christine Lavin."},{"text":"He and his \"Star Wars: Episode IV - A New Hope\" co-star Mark Hamill were both considered for the role of the bumbling wizard Schmendrick in the animated \"The Last Unicorn\"."},{"text":"Has played two (fictional) US Presidents. In \"Air Force One\", he plays President James Marshall. In \"Patriot Games\" and \"Clear and Present Danger\", based on Tom Clancy's series of books, he plays Jack Ryan. Although he did not play the actual President in those films, in Clancy's series Ryan is appointed Vice President and later succeeds to the Oval Office when the President dies."},{"text":"One of his jobs in his early acting days was as a roadie on tour with The Doors."},{"text":"He was offered the title role in \"Schindler's List\" but declined, saying that some people would not be able to look past him as a star to see the importance of the film."},{"text":"Turned down the role of Dr. Curtis McCabe in \"Vanilla Sky\"."},{"text":"During his carpenter days, he built a deck for Sally Kellerman."},{"text":"Graduated high school in the same class as Robert Piepho, the Dean of the UMKC School of Pharmacy."},{"text":"Turned down the role of Bob Barnes in \"Syriana\". He later said that it was one of the few choices in his career that he regretted."},{"text":"Of all the characters he has played, he frequently cites Indiana Jones as both his favorite and the one he is most proud of."},{"text":"His performance as Indiana Jones in the \"Indiana Jones\" franchise is ranked #7 on Premiere Magazine's 100 Greatest Movie Characters of All Time."},{"text":"Was offered the role of Dr. Alan Grant in \"Jurassic Park\" but turned it down. The role went to Sam Neill instead."},{"text":"His two most famous roles were actually not written \"for him\". He became attached to \"Star Wars: Episode IV - A New Hope\" when he was reading lines with other actors doing their screen tests. When it came time to cast \"Raiders of the Lost Ark\", George Lucas was adamant about not casting Ford because he didn't want every movie he did to be a \"Harrison Ford movie\". However, after Tom Selleck backed out, Steven Spielberg suggested Ford again, and Lucas gave in."},{"text":"Presented his \"Indiana Jones and the Last Crusade\" co-star Sir Sean Connery with the American Film Institute's Lifetime Achievement Award, telling him, \"John Wayne gave us the Old West. James Stewart gave us our town. You gave us the world.\" (8 June 2006)"},{"text":"He turned down Kevin Costner's roles in \"JFK\", \"The Untouchables\", \"Dragonfly\", the role of Jack Ryan in \"The Hunt for Red October\" and \"The Sum of All Fears\", Russell Crowe's role in \"Proof of Life\", Nick Nolte's roles in \"Cape Fear\" and \"The Thin Red Line\", Warren Beatty's role as \"Dick Tracy\", Liam Neeson's role in \"Schindler's List\", Mel Gibson's role in \"The Patriot\", George Clooney's roles in \"The Perfect Storm\" and \"Syriana\", Val Kilmer's role in \"Kiss Kiss Bang Bang\", a proposed sequel to \"The Fugitive\", and Tom Skerritt's role in \"Alien\" . He was considered for the leads in \"Jurassic Park\", \"Insomnia\" and \"Who Framed Roger Rabbit\"."},{"text":"In March 2003 \"The New York Daily News\" cleared up conflicting reports of the actor's stance on Iraq war. The newspaper had said numerous reports found Ford opposing the antiwar letter to President George W. Bush in December 2002 from the celebrity group Artists United to Win Without War. However, speaking through his manager Patricia McQueeney, Ford responded his feelings are \"exactly the opposite\" of what had been reported. She told the Daily News that Ford was \"appalled by the idea\" that anyone would think he supports a war with Iraq. \"What I'm for is a regime change on both sides,\" Ford told the Daily News through McQueeney."},{"text":"Because of his \"Blade Runner\" popularity, he became a product spokesperson for Japanese electronics in the 1980s."},{"text":"Sits on the Board of Directors for Conservation International."},{"text":"At one point Hollywood's best paid actor."},{"text":"His mother is of entirely Russian-Jewish heritage, while his father is of Irish- Catholic and German-Protestant heritage. When asked what religion he was raised under he joked \"democrat\", since he has never been observant with any particular religion."},{"text":"His mother Dorothy Ford died of lung cancer on 10 February 2004 at the age of eighty-six."},{"text":"Joined a talent agency for the first time in his career in 1999, following the box office failure of \"Random Hearts\"."},{"text":"A Democrat, he is an opponent of the Iraq war and is very active in environmental issues."},{"text":"Cited as America's Favorite Movie Star in Harris Polls conducted over three consecutive years, from 1998-2000."},{"text":"Danish pop duo \"Souvenirs\" named a song after the actor. The track \"Harrison Ford\" is on the CD \"Villa Danmark\" from 1998."},{"text":"Has named Gregory Peck and Gary Cooper as his favorite actors. Two of his favorite movies are the anti-McCarthyism western \"High Noon\", for which Cooper won his second Oscar, and the civil rights drama \"To Kill a Mockingbird\", for which Peck won his only Oscar."},{"text":"Neither of his two most famous roles (Han Solo and Indiana Jones) were offered to him first. Tom Selleck was the first choice to play Indiana Jones and Christopher Walken was the first choice to play Han Solo."},{"text":"As of May 2007, the combined domestic box office grosses of his films total approximately $3.10 billion, with worldwide grosses approaching the $6 billion mark, making Ford the number 3 all time domestic box-office star behind Eddie Murphy and Tom Hanks."},{"text":"In assembling the 2007 \"Final Cut\" version of \"Blade Runner\", the scene in which Deckard is speaking with the snake dealer, Abdul Ben Hassan, was digitally altered so that Ford's lip movements matched the altered dialog. Since he was unavailable due to scheduling issues, his son Ben Ford, being about the same age as his father had been when filming the movie, was shot on an effects stage after being made up with his father's chin scar."},{"text":"He owns an Aviat Husky."},{"text":"1994: Named Star of the Year by the National Association of Theatre Owners."},{"text":"During his carpentry days, he also remodeled the bathroom of Judy Evans, a costume designer, who later did the costumes for sitcoms such as \"Soap\", \"Benson\", \"The Golden Girls\", & the dramatic series \"Beauty and the Beast\"."},{"text":"Was very close with and greatly admired River Phoenix."},{"text":"On 6 October 2006, he was awarded the Jules Verne Spirit of Nature Award for his work in nature and wildlife preservation. The ceremony took place at the historic Shrine Auditorium in Los Angeles, California."},{"text":"A close friend and golf partner of former President Bill Clinton."},{"text":"Attended high school with Hillary Rodham Clinton and Karen Black (Maine East High School in Park Ridge, Illinois)."},{"text":"One of his heroes is George Lucas."},{"text":"Adopted fiancée Calista Flockhart's son Liam Flockhart."},{"text":"He has two grandsons. Eliel (Willard's son) was born in 1993 and Ethan (Ben's son) was born in 2000."},{"text":"In \"Indiana Jones and the Last Crusade\", Harrison's character refers to a philosophy class taught down the hall by a Dr. Tyree. In real life, Dr. Tyree was Ford's college mentor as a philosophy major at Ripon College."},{"text":"Starred in 5 consecutive films (beginning with \"Apocalypse Now\" and ending with \"Star Wars: Episode VI - Return of the Jedi\") that are on the IMDb Top 250 list. He has 8 films on the list overall, tying for second place with Robert De Niro. James Stewart has the most with 9."},{"text":"Has played three characters named \"Jack\" in four films."},{"text":"Engaged to Calista Flockhart after reportedly asking her to marry him during Valentine's Day weekend of 2009, after the couple had known each other for eight years."},{"text":"Identified in \"Family Guy: Blue Harvest\", a Star Wars spoof, as the only actor not to have his career destroyed by featuring in \"Star Wars: Episode IV - A New Hope\"."},{"text":"He and his first wife, Mary Marquardt, had two children: Benjamin Ford (b. 22 September 1967) and Willard Ford (b. 14 May 1969)."},{"text":"He and his second wife, Melissa Mathison, had two children: Malcolm Carswell Ford (b. 10 March 1987) and Georgia (b. 30 June 1990)."},{"text":"Was offered the role of Garrett Breedlove in \"Terms of Endearment\" but he turned it down due to the age difference between himself and Shirley MacLaine. Jack Nicholson was cast instead and went on to win a Best Supporting Actor Oscar for his performance."},{"text":"Had no formal training as a carpenter. He borrowed books on carpentry from the library, studied them and then practiced in an empty house before he got good enough at it that it became his primary job before becoming a major Hollywood actor. He found he enjoyed carpentry so much that he kept it as a hobby."},{"text":"Mentioned in the song \"One Week\" by the Barenaked Ladies."},{"text":"Lives in Los Angeles, California and Jackson, Wyoming."},{"text":"Of the famous 'friendship circle' of Steven Spielberg, George Lucas, and Francis Ford Coppola, he is the only actor to have worked with all three."},{"text":"Ford and Calista Flockhart's Santa Fe wedding was presided over by New Mexico's governor Bill Richardson. The modest ceremony was attended by Richardson, his wife Barbara and the newlyweds' adopted son Liam Flockhart."},{"text":"Appeared on the cover of GQ magazine five times: April '82, November '86, June '94, November '98 (with George Clooney and Chris Rock) and March 2000 with Tom Cruise)."},{"text":"Stars in four of the American Film Institute's 100 Most Heart-Pounding Movies: \"Raiders of the Lost Ark\" at #10, \"Star Wars: Episode IV - A New Hope\" at #27, \"The Fugitive\" at #33 and \"Blade Runner\" at #74."},{"text":"Tested for the role of Joe Buck in \"Midnight Cowboy\". However, the then-unknown actor was turned down for the role. Jon Voight was eventually offered the role."},{"text":"While attending Ripon College he joined Sigma Nu."},{"text":"First worked with George Lucas on \"American Graffiti\". This actually almost cost him his iconic roles of Han Solo and Indiana Jones. Lucas originally decided he would not used any of the cast of American Graffiti on \"Star Wars: Episode IV - A New Hope\", but changed his mind after asking to Harrison to read for an audition, just so he would have the same number of actors reading for Han as were reading for Luke and Leia. He was later Steven Spielberg's first choice for the role of Indiana Jones, but Lucas initially resisted, saying that, having made two films with him already, he did not want Ford to \"become my Robert De Niro,\" referring to Martin Scorsese's use of him in several films."},{"text":"Has starred in a film that has grossed at least 100 million dollars at the U.S. box office for 5 consecutive decades."}],"nconst":"nm0000148","name":"Harrison Ford"},"copyright":"For use only by clients authorized in writing by IMDb.  Authors and users of unauthorized clients accept full legal exposure/liability for their actions."}