{"exp":1341835456,"@meta":{"serverTimeMs":23,"requestId":"1495WMTAWNMKGXN295M4"},"data":{"quotes":["It's a little-known fact, but I wanted Han Solo to die at the end of \"Star Wars: Episode VI - Return of the Jedi\". I thought it would give more weight and resonance. But George Lucas wasn't sympathetic. He didn't want me killed by those teddy bear guys.","[to theater owners in Las Vegas] I'll make you a deal. I'll try to keep making films that put people in your theatre seats and you try to keep their shoes from sticking to the floor.","[on being a leading man] I'm like a fireman. When I go out on a call, I want to put out a big fire, I don't want to put out a fire in a dumpster.","I used to shake my head, as in \"No, I just look like him.\" But that's not fair. So I said to those little old ladies at Trenton Airport, \"Yes, I am Harrison Ford\". And they still didn't believe it was me.","[on playing Indiana Jones again in \"Indiana Jones and the Kingdom of the Crystal Skull\"] No one wants to see a hero have to pick up his cane to hit someone, but I'm still quite fit enough to fake it.","[on his marriage to Melissa Mathison] It was just part of the continuum of the relationship . . . I don't know if I ever proposed to her.","I don't do stunts - I do running, jumping and falling down. After 25 years I know exactly what I'm doing.","I don't think I've mastered anything. I'm still wrestling with the same frustrations, the same issues, the same problems as I always did. That's what life is like.","[when asked, \"If heaven exists, what would you want God to say to you at the pearly gates\"?] You're a lot better looking in person.","You know you are getting old when all the names in your black book have \"MD\" after them.","I think I did have a reputation for being grumpy. I don't think I'm grumpy. I have opinions. I have an independent vision. I am a purposeful person. But on a daily basis, I think I'm other than grumpy. I think it is a case where I am coming to do business and not there just to be flattered and cajoled and used.","The loss of anonymity is something that nobody can prepare you for. When it happened, I recognized that I'd lost one of the most valuable things in life. To this day, I'm not all that happy about it.","[in 1997 after the \"Star Wars\" trilogy was reissued, explaining his disinterest in repeating the role of Han Solo] Once a film is finished, it's over for me. I'm on to something else.","[acknowledging that George Lucas and Steven Spielberg originally wanted another actor to play Indiana Jones] My playing Indy was mentioned to me about only six weeks before shooting started, but being second choice wasn't at all offensive. I would always assume that it would be normal for a director - once having worked with an actor in a particular part - not to think of him for something else. I'd presume that he'd want to accentuate the difference between the two characters by having another actor. I was more than happy when they did ask me to play Indiana Jones, because it promised to be a terrific role in a great film.","[about the early days of his career] I started by chasing a Folger's commercial. But I just somehow couldn't manage to say, \"Honey, that's a great cup of coffee\".","[on what made him choose acting as a profession] Failure in all other fields.","[in People magazine, 6/23/03] There have been times in my life when I have felt I was lonely, but I don't think you want to live your life in order to mitigate against loneliness.","[asked if he would ever play Indiana Jones again] In a New York minute.","[asked if he would ever play Han Solo again] No, because I have outgrown that character.","[after his first screen test] The studio guy told me, \"Kid, you have no future in this business.\" I said, \"Why?\" He said, \"When Tony Curtis first walked onscreen carrying a bag of groceries -- a bag of groceries! -- you took one look at him and said, 'THAT'S a movie star!'\" I said, \"Weren't you supposed to say, 'That's a grocery delivery boy?' \"","I had no expectation of the level of adulation that would come my way. I just wanted to make a living with a regular role in a television series.","[explaining how Indiana Jones and Han Solo differed] Different clothes, different character. That's how I feel about it.","[talking about \"Blade Runner\"] It could have been so much more than a cult movie.","Starring in a science-fiction film doesn't mean you have to act science fiction.","Whoever had the bright idea of putting Indiana Jones in a leather jacket and a fedora in the jungle ought to be dragged into the street and shot.","[talking about the appeal of Indiana Jones] Indiana Jones is always getting in way over his head and just barely getting out by the skin of his teeth.","[asked if he believes in \"The Force\"] I think The Force is in you. Force yourself.","[talking about George Lucas] I think George likes people. I think George is a kind, warm-hearted person, but he can be a little impatient with the nature of acting, the need to work 'til you find something. He's like, \"It's right there, it's right there, I wrote it, it's there, just do it\". But you can't just do it that easily.","I am not the first man who wanted to make changes in his life at 60 and I won't be the last. It is just that others can do it with anonymity. I was interested in changing my life. I have always had the ability to change and become other people through my acting. I took a good look at myself and decided I wanted something different from the way I was living. That's not such a bad thing, is it? But, because of my past, I think it took a lot of people by surprise. They wondered what was happening to me. I was very much aware of what was happening. I'm living the way I want to live.","I think American films right now are suffering from an excess of scale. Lots of movies we're seeing now are more akin to video games than stories about human life and relationships. Twelve- to 20-year-olds are maybe the largest economic force in the US movie business. I'm not a very nostalgic person - but I enjoy a good story.","I'm very troubled by the proliferation of arms, at the fact so many people in the United States carry guns. It obviously contributes greatly to the crime problems we have. I'm sure gun laws should be strengthened in the United States. I just don't know the correct mechanism.","I'm very disturbed about the direction American foreign policy is going. I think something needs to be done to help alleviate the conditions which have created a disenfranchised and angry faction in the Middle East. I don't think military intervention is the correct solution. I regret what we as a country have done so far.","What does that mean [when a director says] \"Ttrust me\"? Does that mean I should obviate all of my experience? Should I replace a certain knowledge with belief? Where does that get you? I have had experience in my life. I am 63 years old. Why should I be trusting a director?","My approach to acting is the \"let's pretend\" school of acting. If real emotion is available, use it, otherwise I follow what I think is an AA rule: \"Fake it 'til you make it\". Emotions are an interesting language. Sometime they sneak up on you when you're not expecting, when you are available to it.","[on \"Star Wars: Episode IV - A New Hope\"] I understood the impact of those movies because I had young children who watched them religiously. I saw the \"Star Wars: Episode IV - A New Hope\" films so often in my house that I ended up knowing all of the other actors' lines.","I am a kinder, gentler Harrison Ford than I once was.","It's very little trouble for me to accommodate my fans, unless I'm actually taking a pee at the time.","Before, I was grateful for a job, almost any job. Now, I'm apprehensive but I know I have other options, and when I ask for the money, they pay it. It's that simple.","I saw a bit of director Stephen Gaghan's movie \"Syriana\", and I wish I'd played the part that was offered to me - [George Clooney]'s part. I didn't feel strongly enough about the truth of the material and I think I made a mistake. I think the film underwent some changes, and I think a lot of it is very truthful: the things that I thought weren't, were obviated after I left the table.","I had a very strong feeling about the Vietnam War, and I had a strong feeling about participating in it. The military draft was in place, I was summoned for a physical exam, and I was either going to be classified as fit for military service or make my objection to it. So I made my objection to it.","I grew up in the Midwest. You don't ask what a person's religion is, you don't ask what their politics are, you don't ask how much money they make and I pretty much still have that attitude about it. It's none of anybody's business and I don't advantage anyone by telling them what my personal politics are . . . The arguments are much too subtle to be entered in that way, to my mind. There are things that I think are happening in the world that are egregious mistakes but I'm only operating out of my own box and I don't have any expertise. I'm a voter . . . I have one vote, that's all I should have.","I don't want to be a movie star. I want to be in movies that are stars.","[about Han Solo, speaking in 1979] He's not a cardboard character to me at all. He's as real as anything else. I never thought of the character as having only two dimensions until the critics said so. And they're wrong. The third dimension is me.","Identification solely with \"Star Wars: Episode IV - A New Hope\" could have been the beginning and the end, with no middle, to my career.","[on registering as a conscientious objector during the Vietnam war] I confused them so badly that they never took action on my petition. My conscientious objection wasn't based on a history of religious affiliation, which made it difficult at the time. I went back to my philosophy training from college. I remembered Paul Tillich's phrase, \"If you have trouble with the word God, take whatever is central or most meaningful to your life and call that God\". I always had trouble with the notion of God in a stand-up form. So I developed a thesis and took the Biblical injunction to love thy neighbor as thyself as the central and most meaningful thing in my life. I combined it all and typed for days and sent it off and never heard a word. Never got called in.","I am Irish as a person, but I feel Jewish an an actor.","Los Angeles is where you have to be if you want to be an actor. You have no choice. You go there or New York. I flipped a coin about it. It came up New York, so I flipped again. When you're starting out to be an actor, who wants to go where it's cold and miserable and be poor there?","If people recognize me when I'm out in public, I'm very nice to them. I'm very nice to people even when they don't recognize me. I don't even mind if people come up to me while I'm eating dinner, but if they recognize me while I'm having sex, I refuse to sign autographs.","I'm old enough to play my own father in this one. Sean's only twelve years older than I am. In \"Indiana Jones and the Last Crusade\" I had to play so much younger than I am in order to make it work for him. It was really a strain.","[on \"The Mosquito Coast\"] That's a movie I like very much. It gave me an opportunity to turn people's perception of me on its head.","[on fatherhood]: My first child was born when I was 25. Babies raising babies is not a pretty sight. I'm much better at it now.","[on George Lucas] A fountain from which my career sprang, more or less.","[on acting] - I love it. I don't feel as useful any place as I do on a movie set. I'm very surprised and delighted at the luck I've had. I've been enormously lucky. I've had a long run. And now I have a chance to play old guys.","[on what he looks for in a film] I look for those things that I can have an emotional investment in. ... I disadvantage myself by thinking, 'Oh, this is what I'm looking for, this is what I like.' I don't know what I like. I like what I like. ... being an assistant storyteller, helping create characters that bring a story dramatic shape and dimension.","I make a character out of those things that allow him to tell the story. I'm not an actor who will say, 'Well, my character would never do that.' If the story requires it, then I'll find a way of accommodating that in character. For me, it's not about performance. It's about storytelling. Once I get a clear idea of what I want to accomplish, then acting is just dressing up and playing.","[on Steven Spielberg] It's hard to say why someone is successful or not successful, but Steven has all of the mental capacities and the film chops to make successful movies. I think he understands human emotion very well and he understands dramatic construction and he understands cinema. And if he chooses to do a popular film, it will likely be very successful. If he chooses to do something with a different kind of ambition, then Steven is secure enough I think to let the chips fall where they may.","[on \"Sabrina\"] Somehow Sydney Pollack and I talked ourselves into working on that. Sydney's gone now. I miss him. We both lived long enough to regret it. There is no reason to do something that's already been done. But happily we launched the careers of Greg Kinnear and Julia Ormond, who is wonderful in the movie. She's gone on to have a good career. It was a noble effort, a bizarre adventure for both of us.","[About acting and accessing emotions] You have to be willing to *live* in front of people. Live in front of people. Let them see the good, the bad, the ugly, the weak, the strong, the conflicted, the terrible... One of the things about acting that gives me the greatest satisfaction is the opportunity for that emotional exercise. That investment to the point where it produces true emotion.","(2010, on acting in film) I'm in it for the money. And I mean that in the nicest possible way. This is my job. Acting is my craft, I've spent my whole life working on it and I want to get paid well to do it, because otherwise I'm being irresponsible, not valuing what I do for a living. When I came into this business I didn't even know the names of the movie studios - I was under contract to a studio for $150 a week. One thing I learned is that the studios had no respect for a person who was willing to work for them for that amount. So I realized that the value I put on my own work was the value and respect I would get back.","(2010, on fame) There's nothing good about being famous. You always think, 'If I'm successful, then I'll have opportunities.' You never figure the cost of fame will be a total loss of privacy. That's incalculable. What a burden that is for anybody. It was unanticipated and I've never enjoyed it. You can get the table you want in a restaurant. It gets you doctor's appointments. But what's that worth? Nothing. The real coin of the realm is freedom - to make choices, do the projects that you want to do and have some control over the stories and the way a film is released and sold.","(2010) I'm so passionate about flying I often fly up the coast for a cheeseburger. Flying is like good music: it elevates the spirit and it's an exhilarating freedom. It's not a thrill thing or an adrenaline rush; it's engaging in a process that takes focus and commitment. I love the machines, I love the aviation community. I used to own airplanes and have pilots flying them for me, but I finally realized they were having more fun than I was. They were getting to play with my toys. I was 52 when I started flying - I'd been an actor for 25 years and I wanted to learn something new. Acting was my only identity. Learning to fly was a lot of work, but the net result was a sense of freedom and a pleasure in seeing to the safety of myself and the people who fly with me. All of my planes are great to fly, and that's why I've got so many of them. I have a Citation Sovereign, a long-range jet; a Grand Caravan, a turboprop aircraft capable of operating on unimproved strips; and a De Havilland, a bush plane. I have a 1929 Waco Taperwing open-top biplane; a 1942 PT-22 open-top monoplane trainer; an Aviat Husky, a two-seat fabric-covered bush plane; and a Bell 407 helicopter. I also have more than my fair share of motorbikes - eight or nine. I have four or five BMWs, a couple of Harleys, a couple of Hondas and a Triumph; plus I have sports touring bikes. I'm a single rider, and I love being out in the air. I like the focus that comes when you're riding - you really have to be very keyed into what you're doing. I ride up into the mountains in LA on twisty little canyon roads on Sunday mornings with a group of other enthusiasts.","(2010) There's nothing better than seeing a herd of elk right outside the window of my house in Wyoming. My land gives me an opportunity to be close to nature, and I find spiritual solace in nature, contemplating our species in the context of the natural world. The property is much the same as it was 150 years ago. It's in the mountains and had never been developed when I bought it. Apart from the home and outbuildings, I've kept it pretty much in that state. I know that the property will be there for as long as I live and well after that in the hands of my children."],"nconst":"nm0000148","name":"Harrison Ford"},"copyright":"For use only by clients authorized in writing by IMDb.  Authors and users of unauthorized clients accept full legal exposure/liability for their actions."}