{"exp":1341835461,"@meta":{"serverTimeMs":23,"requestId":"1R5XQWXWQA720S5F21NT"},"data":{"tconst":"tt0898266","type":"tv_series","title":"The Big Bang Theory","unspoilt":[{"text":"The two main characters (Sheldon Cooper and Leonard Hofstadter) are named after late television producer Sheldon Leonard."},{"text":"Penny was an add-on from a different sitcom concept. She had been originally envisioned as Katie, a more cynical, hard-drinking, streetwise girl who worked at a makeup salon. In the original unaired pilot, she was played by Amanda Walsh."},{"text":"The original working title of the show was \"Lenny, Penny, and Kenny.\""},{"text":"Sheldon is from Texas, as is Jim Parsons."},{"text":"Raj's inability to talk to women except when drunk is based on an old coworker of executive producer Bill Prady when he worked at a computer company."},{"text":"Sheldon frequently wears T-shirts with the characters or symbols of Green Lantern, the Flash, or Superman. The shirts from the \"Green Lantern\" comic book series have a specific color with a corresponding symbol, with each color representing a different corps of heroes or villains (e.g. Red Lanterns, Orange Lanterns, etc). In the comics, each color also represents a specific emotion: Red=Anger, Orange=Greed, Yellow=Fear, Green=Willpower/Courage, Blue=Hope, Indigo=Compassion and Violet=Love. Not surprisingly, the color of shirt Sheldon wears in each scene is often a clue to his mood. These colors are also the exact colors of a real rainbow. The order of colors in a rainbow is easiest to remember by the following mnemonic (a formula that helps one remember something): Richard Of York Gave Battle In Vain. R=red, O=orange, Y=yellow, G=green, B=blue, I=indigo, and V=violet. Red is naturally at the top edge (longest, or coolest in the spectrum) of the rainbow and violet is at the bottom edge (shortest, or hottest in the spectrum), with the other colors, in the same order of Sheldon's superhero and mood shirts, in between."},{"text":"While Wil Wheaton was appearing on the show, he took a photo of the set's coffee table and posted it on his much-followed blog. Among the materials on the coffee table were copies of \"Mental Floss\" magazine; \"The Sandman Vol. 6: Fables and Reflections\" by Neil Gaiman; a package of Pepperidge Farm Sausalito milk chocolate macadamia nut chunk cookies; a package of Red Vines licorice; and a package of Tim's brand Original Flavor lightly salted potato chips."},{"text":"Some of the signs in the laundry room read \"No open containers on the machines,\" \"Do not leave laundry unattended,\" and \"Please keep your clothes on while doing laundry.\""},{"text":"Despite the fact that some viewers take Sheldon's behavior, mannerisms, and social skills as a sign that Sheldon has Asperger's Syndrome or otherwise falls on the \"Autism spectrum,\" the show-runners have persistently denied in many interviews that Sheldon has Asperger's or Autism."},{"text":"In fall 2010, Kaley Cuoco revealed to \"CBS Watch! Magazine\" that she and her \"Big-Bang Theory\" co-star and love interest Johnny Galecki had secretly dated for two years earlier in the run of the show, but they were no longer together."},{"text":"Leonard's last name, Hofstadter, refers to two well-known scientists: Robert Hofstadter, the 1961 Nobel Laureate in Physics, and his son Douglas Hofstadter, who researches consciousness and cognition, and whose best-selling book about philosophy, mathematics, puzzles, art, and music, \"Gödel, Escher, Bach: an Eternal Golden Braid,\" was published in 1979 and won him the 1980 Pulitzer Prize for general nonfiction."},{"text":"As the series progressed, each taping of the show was attended by Caltech students."},{"text":"Sheldon verbally reveals his and Leonard's Pasadena apartment 4A's location as being 2311 Los Robles in \"The Desperation Emanation.\" In the 100th episode, Sheldon also reveals that their apartment building is across the street from the Colorado Avenue Chevron gas station, making their building a corner location, on the corner of Los Robles and Colorado. There are two incidences of this intersection in southern California, both located in Los Angeles County, the first one is E Colorado Blvd & N Los Robles Ave, Pasadena, CA 91101, and the second one being Colorado Blvd & Los Robles St, Los Angeles, CA 90041. However, 2311 Los Robles is not an address by either one of those intersections."},{"text":"Recurring guest Mayim Bialik is the only cast member to have a PhD. In 2008, she completed her neuroscience studies."},{"text":"On 14 January 2011, CBS gave the series a rare vote of confidence when it issued a three-year renewal through the 2013-14 season."},{"text":"The character Howard Wolowitz is named after someone the creator worked with at a computer company."},{"text":"Most of the time Leonard has no glass in his glasses."},{"text":"Sara Gilbert (Leslie) who plays a former girlfriend of Leonard's, also played Johnny Galecki's girlfriend in \"Roseanne\". Laurie Metcalf, who plays Sheldon's mother, was also his co-star in Roseanne."},{"text":"Kaley Cuoco missed filming a few episodes of season 4 because of a broken leg, the result of a horseback riding mishap."},{"text":"Kaley Cuoco presented the award Best Performance by an Actor in a Television Series - Musical or Comedy at the 2011 Golden Globe Awards to costar Jim Parsons"},{"text":"In the original unaired pilot, the theme song of the show was \"She Blinded Me with Science\" by Thomas Dolby. However, later on a short MIDI rendition of the song is used as Howard's ringtone in S2E8 \"The Lizard-Spock Expansion\"."},{"text":"Barry Kripke (played by John Ross Bowie) has exactly the same speech impediment as Elmer Fudd - also a Warner Bros. property."},{"text":"Leonard's middle name is Leakey. Leakey is the name of a renowned family in the fields of archaeology, anthropology, and paleontology. Louis Leakey (1903-1972) was a British archaeologist and naturalist whose critical work helped to establish human evolutionary development in Africa. He also created or co-created several organizations for future research and for protecting wildlife in Africa. He also helped to establish a tradition of palaeoanthropological inquiry, and was able to motivate the next generation to continue, especially within his own family. Mary Leakey (1913-1996), Louis's wife, was a British archaeologist and anthropologist, who discovered many firsts. For much of her career she worked together with her husband, Louis Leakey, in Olduvai Gorge, uncovering relics of ancient hominines. She also developed a system of classification the relics they found. After the death of Louis, she became a leading palaeoanthropologist, helping to further establish the Leakey name and tradition with the training of her son, Richard."},{"text":"Jim Parsons audition for the role of Dr. Sheldon Cooper was so good that creator Chuck Lorre immediately asked Parsons to come in for a second one, because Lorre wanted to be 100% sure Parsons was as brilliant as he seemed. After the 2nd audition went perfectly, Lorre cast Parsons on the spot."},{"text":"During the third season, the producers became aware of a series called 'The Theorists', produced and broadcast in the country of Belarus, that was a virtual copy of \"The Big Bang Theory\". Legal action over copyright infringement would be as good as futile, since the production company was pretty much owned by the Belarus government. However, a lawsuit turned out not to be necessary, because when word got out that the show was a rip-off, the actors quit and the show was immediately canceled."},{"text":"The full names and occupations of the characters are: Dr. Leonard Leakey Hofstader Ph.D., Experimental Physicist; Dr. Sheldon Lee Cooper B.S. M.S. M.A. Ph.D. Sc.D., Theoretical physicist; Howard Joel Wolowitz M.Eng, Aerospace Engineer; Dr. Rajesh Ramayan Koothrappali Ph.D., Astrophysics; Dr. Bernadette Mary Ann Rostenkowski Ph.D., Microbiology; Dr. Amy Farrah Fowler Ph.D., Neurobiology."},{"text":"While a guest on the National Public Radio program \"Talk of the Nation,\" Mayim Bialik confirmed that the university that the characters attend and/or teach at is based on the California Institute of Technology (Caltech) in Pasedena."},{"text":"Each of the male characters has a signature clothing article worn in virtually every episode: Sheldon - t-shirts; Leonard - hoodies; Raj - warm-up suit jackets; Howard - turtlenecks/dickies."},{"text":"Howard's mother's voice is heard throughout the show, but her face has never been actually seen on-screen. (She did appear very briefly on-screen in the season 5 finale, as the camera pans up from the roof top, but her face was still never shown.)"}],"year":"2007"},"copyright":"For use only by clients authorized in writing by IMDb.  Authors and users of unauthorized clients accept full legal exposure/liability for their actions."}