{"exp":1341835454,"@meta":{"serverTimeMs":24,"requestId":"0BA3FZCVAJYAF17X901S"},"data":{"user_comments":[{"user_rating":10,"date":"2007-10-01","status":"G","user_name":"Awakening124","summary":"CBS, please keep this on the air!!!!","user_score":404,"text":"When my boyfriend tuned into the premiere I thought the show was going to be stupid. I was so surprised. This is the first TV show to really showcase nerds with pretty much dead on accuracy. This has a sparkling cast (Jim Parsons is the new and improved David Hyde Pierce) and fantastic humor that ranges from light slapstick to seriously quick wit. This show is a great love letter to nerds, and as such any nerd should give this a try. With a bunch of new (and very lame) shows debuting, it's good to see something worth watching! This premise isn't exactly new but the execution is nothing short of brilliant. Give it a shot!!","user_location":"United States","user_score_count":483},{"user_rating":8,"date":"2007-10-02","status":"G","user_name":"lbarrentine-1","summary":"Very funny show","user_score":281,"text":"I found the show to be very funny. The laugh track needs to go though. I was afraid that the girl would be portrayed as a really stereotypical dumb blonde. I was glad to see that she is not. Granted she isn't a nerd genius like the rest of the characters, but she is just your average person. There is a lot of subtle humor mixed in with the obvious jokes. Good show and I hope it lasts as there are very few comedies on Television now that can actually make me laugh.\n\nBefore 100 people insult my taste, humor is subjective. If you can identify with the subject matter, it is funny to you. If you can't, it isn't. Having worked in Information Technology for over 25 years, I can see a lot of myself and my friends in Sheldon and Leonard.\n\nBy the way, if you are my age, you may get the nod to one of the greats of TV comedy in the lead characters first names.","user_location":"United States","user_score_count":332},{"user_score":232,"summary":"One of TV's Best Written Sitcoms","user_location":"St. Louis Park, MN","text":"I have seen a few episodes of the new CBS sitcom The Big Bang Theory and to me it's one of the best written sitcoms currently on network TV. The scripts are filled with scientific references some people might not understand but they are very witty. Johnny Galecki and Jim Parsons are definitely one of TV's newest comedy teams who have great chemistry and the addition of Kaley Cuoco as their neighbor, Penny brightens up the show. Let's not overlook the supporting cast with Simon Helberg as Wolowitz, who looks a little like Paul Reubens, the man behind Pee-Wee Herman and Kunal Nayyar as their friend from India. \n\nIf you watch the closing credits closely, you'll notice that there's a credit saying \"Science Consultant.\" It's the first sitcom to employ one. It was a very good idea by the show's creator Chuck Lorre, who also is behind the CBS hit Two and a Half Men to hire one to bring scientific honesty into the show. \n\nI hope The Big Bang Theory is around for several years. It has a solid future.","date":"2007-12-18","status":"G","user_score_count":267,"user_name":"hfan77"},{"user_rating":10,"date":"2007-10-08","status":"G","user_name":"TheWinterSolstice","summary":"Excellent sit-com by the brilliant Chuck Lorre","user_score":164,"text":"Definitely slated to be the best sitcom of this season, this is a creative and funny show. Two geeks have a beautiful girl (Penny) move to the apartment next door. The two geeks have two friends that are even geekier. Here is the many ways in which this show excels: the geeks are lovable and funny and human, not pathetic, you feel for them, the neighbor girl is a very sweet girl, and for once the characters are educated and thoughtful, not the usual \"dumb\" people we see on TV. The dynamics and the dialog between the four friends is fast paced, funny and rich with detailed observations. This is a comedy by Chuck Lorre, the guy who has created Dharma (from Dharma & Greg) so I am fully expecting Penny's character to bloom into far more than what meets the eye. The four male leads establish their personalities in the pilot with such ease that it's clear we are watching a very well written and well acted show. Kudos to the whole cast and the writers. I hope this funny, smart show stays around. We need a comedy with wit and heart, and for a change - lovable geeky brains too.","user_location":"US","user_score_count":199},{"user_rating":10,"user_score":158,"summary":"Best show I've seen in a long time","user_location":"United States","text":"I just love this show! If you can appreciate great writing and great acting than this show is for you.\n\nMy favorite episode is \"The Big Bran Hypothesis\". That was hilarious. I hadn't laughed like that in a long time. When Leonard came out of his room in his underwear armed with a light-saber, I thought I was going to hurt myself I was laughing so hard. And the whole \"sarcasm\" bit was perfect comedy genius. And it's not just that the comedy is written so well - - the timing is dead on! The actors are truly artists.\n\nBravo CBS! I'm hooked and will keep watching!\n\nAnd if anyone reading hasn't seen the show yet, check it out!","date":"2007-10-17","status":"S","user_score_count":189},{"user_rating":8,"date":"2007-10-29","status":"G","user_name":"genuinebovdiesel","summary":"Give It a TRY!","user_score":199,"text":"Being a physicists, I'm unsure of what to think of this show; however, the chemistry between the \"nerds\" is terrific! It is great to turn on a show that helps bring me back down to earth. The show may be a tiny bit unrealistic when it comes to how \"nerds\" actually behave, but you don't have to be a nerd to appreciate the science humor. In the same respect, the behavior of the \"regulars\" is a little exaggerated, but is done in such a way which helps accentuate the characters' contrast.\n\nSo what is to lose from watching this show? \n\nYou WILL be laughing by the end!\n\n(The End)","user_location":"MI","user_score_count":288},{"user_rating":10,"date":"2008-05-31","status":"G","user_name":"tonyfencer","summary":"Finally A Show About Us","user_score":127,"text":"This show is brilliantly written, has a fantastic cast, keeps you laughing from start to finish of every episode, and shows that even particle physics can be funny. For some of you who may not have seen The Big Bang Factor yet it is a lot like Scrubs if you crank up the geek factor and move the characters from a hospital to a laboratory.\n\nI'm not sure what CBS is doing to promote this series but clearly it is not enough. I heard about this show through a friend and I have never seen a commercial for it ever. I don't know if CBS is trying to keep this show a secret or if their marketing guys just fell asleep at the wheel but this show is fantastic.\n\nThe characters, that seem exaggerated at first, are actually believable if you have ever been to a physics conference of any kindor for that matter any comic-con. These \"geeks\" make up an ever growing segment of our population and I think it is wonderful that they finally have a show to call their own. Perhaps I am biased because of my own nerd tendencies but I have had arguments exactly like the ones in this show with my own clique of nerdy friends. To anyone who ever enjoyed math class watch this show and get your friends who didn't like math class to watch too because if they get you they will get this show.","user_location":"United States","user_score_count":166},{"user_rating":9,"date":"2008-05-13","status":"G","user_name":"yodaoreo","summary":"Can't Get Enough","user_score":93,"text":"I didn't expect much from this show at the beginning of this season, but I have been pleasantly surprised. It has actually become my favorite show this year.\n\nNow, with only one new episode left this season I will miss it over the summer and hope to see it back next year (PLEASE CBS!!!). \n\nThere are so many aspects of the show I like. First, I love how various aspects of the nerds relate to the folks I know (mostly in IT). Second, I love how the show flirts with the stereotypes, such as the dumb blond, but doesn't quite go there. Penny is not dumb, and Raj can be quite social if the circumstances are right. The blending of intellectual and ridiculous is also very well done, so that neither is overwhelming.\n\nKeep it up, and keep this on TV!","user_location":"United States","user_score_count":110},{"user_rating":10,"date":"2008-01-19","status":"G","user_name":"Xander Seavy (RiffRaffMcKinley)","summary":"A Winner in the Classic CBS Tradition","user_score":117,"text":"The network that produced such classic sitcoms in the past as \"All in the Family\" and \"The Munsters\" does it again with \"The Big Bang Theory,\" a tremendous success for Chuck Lorre following his drastic failure with \"Dharma & Greg\".\n\n\"BBT\" follows the witty and sarcasm-soaked misadventures of Leonard and Sheldon, two socially awkward scientists thrust full-force into standard sitcom story lines-- themes of rejection, friendship, and pride, among others. The important thing is, the standard sitcom story lines feel new for the first time in decades, mainly because the mile-a-minute dialogue now comes with gloriously incomprehensible techno-babble and high-level jargon that could send Kissinger screaming from a room.\n\nIt comes down to essentially this. Spot-on writers and directors handle a spot-on cast in spot-on situations. Those of you who are turned off of shows by audience laughter, it adds a much-needed level of reality to this surreally present crowd-pleaser. And when the Writers' Strike ends (still happening as this is being written), fans of great comedy should look forward to much more from this high-potential hit.\n\nBecause it all started with the Big Bang.","user_location":"United States","user_score_count":160},{"user_rating":9,"date":"2007-10-16","status":"G","user_name":"slr_imaging","summary":"Guilty Pleasure","user_score":100,"text":"This show is definitely one of my guilty pleasures! Tuesdays are spent anxiously awaiting its posting on iTunes so I can download it, as I live in Canada & don't have cable. TBBT is a trip down memory lane for me, as it IS my high school experience (20+ years ago, I was a smarter Penny). I love the characters, especially Leonard who is adorable, and the smarmy yet surprisingly charming Wolowitz. It has the feel of \"Frasier Goes To College\". I do agree though that they should lose the laugh track - annoying, but not enough to make me stop watching. BTW, very smart of CBS to originally have offered the pilot as a free download or I would never have given it a look. Now I'm an addict!","user_location":"Canada","user_score_count":133}],"tconst":"tt0898266","limit":10,"type":"tv_series","title":"The Big Bang Theory","total":183,"year":"2007"},"copyright":"For use only by clients authorized in writing by IMDb.  Authors and users of unauthorized clients accept full legal exposure/liability for their actions."}