{"exp":1341925350,"@meta":{"serverTimeMs":21,"requestId":"1JZ7T74KDDG20A6KJ4G6"},"data":{"plots":[{"text":"Jules Winnfield and Vincent Vega are two hitmen who are out to retrieve a suitcase stolen from their employer, mob boss Marsellus Wallace. Wallace has also asked Vincent to take his wife Mia out a few days later when Wallace himself will be out of town. Butch Coolidge is an aging boxer who is paid by Wallace to lose his next fight. The lives of these seemingly unrelated people are woven together comprising of a series of funny, bizarre and uncalled-for incidents.","author":"Soumitra"},{"text":"The film initiates with two small-time thieves, Honey Bunny and Pumpkin, who spontaneously decide to hold up a restaurant. The film then shifts to the story of Jules and Vincent, who hit men for the well known and feared Marsellus Wallace, who is caught up in a deal gone wrong with struggling boxer Butch Coolidge.","author":"David Landers <dml@gwis.com>"},{"text":"Pumpkin and Honey Bunny are two thieves who, while dining at a coffee shop, decide that the best thing to do is to rob it. Vincent and Jules, two hit men working for mob kingpin Marcellus Wallace, are sent to retrieve a very special and very mysterious briefcase for their boss. Vincent later must also show Mrs. Wallace a good time while her husband is out. Butch Coolidge is an aging prizefighter who is being paid to \"take a dive\", but instead, accidentally kills him opponent, and tries to flee town, but not before getting his dead father's lucky golden watch. These four seemingly unrelated stories are interwoven together in a non-linear fashion.","author":"movies_are_forever"},{"text":"Jules and Vincent work as hitmen for crime boss Marcellus Wallace. Wallace is currently dealing with Butch Collidge, a boxer who failed to throw a fight after taking Wallace's money and is now planning to flee the city, but can't leave his father's watch behind. Vincent faces some problems of his own when Wallace asks him to show his wife Mia a good time while he's away. Some of these people redeem themselves and some don't, and all meet an end appropriate to their choices.","author":"rmlohner"},{"text":"Vincent Vega and Jules Winnfield are two hitmen on the hunt for a briefcase whose contents were stolen from their boss, Marsellus Wallace. They run into a few unexpected detours along the road. Marsellus is out of town, and he's gotten Vincent to take care of his wife, Mia. That is, take her out for a night on the town. Things go smoothly until one of them makes a huge error. Butch Coolidge is a boxer who's been approached by Marsellus and been told to throw his latest fight. When Butch ends up killing the other boxer, he must escape Marsellus. Pumpkin and Honey Bunny (not their real names) are two lovebirds/thieves who have decided to rob the restaurant they're currently eating at. But the restaurant doesn't turn out to be as easy as the other places they've robbed.","author":"G-reaper"}],"tconst":"tt0110912","type":"feature","title":"Pulp Fiction","year":"1994"},"copyright":"For use only by clients authorized in writing by IMDb.  Authors and users of unauthorized clients accept full legal exposure/liability for their actions."}